# список образовательных программ
programs = ["Экономика", "Бизнес-информатика", "Туризм"]

# список дисциплин
subjects = ["Эконометрика", "Базы данных", "Теория игр",
            "Программирование на Python"]

# список мероприятий
events = ["Русский медвежонок", "Я-Профессионал",
          "ЗаБег", "Russkiy MeetUp"]

# словарь с описанием дисциплины
subject_dict = {
    "Эконометрика": "наука, изучающая количественные и качественные экономические взаимосвязи с помощью "
                    "статистических и других математических методов и моделей.",
    "Базы данных": "упорядоченный набор структурированной информации или данных, которые обычно хранятся в "
                   "электронном виде в компьютерной системе.",
    "Теория игр": " математический метод изучения оптимальных стратегий в играх. ",
    "Программирование на Python": "высокоуровневый язык программирования общего назначения, который используется в "
                                  "том числе и для разработки веб-приложений. "
}

# словарь с описанием мероприятия
event_dict = {
    "Русский медвежонок": "самая лучшая олимпиада по русскому языку для всех учеников.",
    "Я-Профессионал": "олимпиада для настоящих молодых специалистов.",
    "ЗаБег": "легкоатлетический марафон.",
    "Russkiy MeetUp": "IT-конференция о геймдеве, кибербезопасности, машинном обучении и многом другом."
}
